<!-- dflook/terraform-github-actions {"workspace":"tf-1-3-0-backend-version-detection","backend":"6627ee1bbe8affb088baddd7dc8b9e0d32d0326ab963eb17be6083d677fadf46","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","plan_job_ref":"Job Test plan target and replace #246 at https://github.com/dflook/terraform-github-actions/actions/runs/3122832201","plan_hash":"34b271ca9ea02cf9a4e2b5f2d4634dfa0e2530b1d75ce138c2c281e5862f35af","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tf-1-3-0-backend-version-detection__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ foreach = "onVDOVoK2O" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #246](https://github.com/dflook/terraform-github-actions/actions/runs/3122832201)